authenticate-me/app/models/user.rb

  def generate_unique_session_token
    while true
      token = SecureRandom.urlsafe_base64
      return token unless User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]

  def self.find_by_credentials(credential, password)
    user = User.find_by(username: credential) || User.find_by(email: credential)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-lition"], ["LIMIT", 1]]